Revit 2027 API
ParameterTypeId.PathReinHookOrient2Wall Property
 "Alternating Bar - Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinHookOrient2Wall { get; }
Public Shared ReadOnly Property PathReinHookOrient2Wall As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinHookOrient2Wall {
	ForgeTypeId^ get ();
}
static member PathReinHookOrient2Wall : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace